app/controllers/portfolio_controller.rb

INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mattie Rice"], ["email", "mvkarsten@gmail.com"], ["message", "Hi there!"], ["created_at", "2019-10-25 02:23:50.246531"], ["updated_at", "2019-10-25 02:23:50.246531"]]
---
  def message
      @message = Contact.create ( message_params)